Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: །འཇིག་རྟེན་མགོན་དང་མཉམ་མེད་སུ་ཞིག་ལྷག །ཐམས་ཅད་མཁྱེན་པའི་ཡོན་ཏན་ཀུན་ལྡན་པ། །སངས་རྒྱས་ཡེ་ཤེས་འདོད་ཅིང་ཐོབ་པར་གྱིས།
en: Who can equal the Lord of the World, let alone be greater. You should long for and attain the wisdom of the buddhas, Who possess all the qualities of omniscience. {12} “The Lord of the World is completely beautiful,

source: །སྐུ་ལུས་དག་ནི་གསེར་གྱི་མདོག་འདྲ་བས། །འཇིག་རྟེན་མགོན་པོ་ཀུན་ནས་རབ་ཏུ་མཛེས། །དམིགས་པ་འདི་ལ་གང་གི་སེམས་འཇུག་པ།
en: With a body that is the color of gold.

source: །བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་མཉམ་གཞག་ཡིན།
en: Bodhisattvas will rest in meditation When their mind is focused upon that image. {13}

source: །མཁས་པས་འདུས་བྱས་འདུས་མ་བྱས་རིག་སྟེ།
en: “The wise who understand the composite and noncomposite

source: །མཚན་མའི་འདུ་ཤེས་དག་ནི་རྣམ་བཤིག་ནས།
en: Have ceased conceptualizing attributes.

source: །མཚན་མ་མེད་པ་ལ་ནི་དེ་གནས་ན།
en: They remain in that meditation of the absence of attributes

source: །ཆོས་རྣམས་ཐམས་ཅད་སྟོང་པར་རབ་ཏུ་ཤེས།
en: And know the emptiness of all phenomena. {14}

source: །གང་དག་ཆོས་ཀྱི་སྐུ་ལ་གནས་གྱུར་པ།
en: “Those who remain in the dharmakāya

source: །དེ་ནི་དངོས་པོ་ཐམས་ཅད་དངོས་མེད་ཤེས།
en: Know that all things are nothing.

source: །དེ་ཡིས་དངོས་པོའི་འདུ་ཤེས་རྣམ་བཤིག་ནས།
en: Those who have ceased conceptualizing things

source: །རྒྱལ་བའི་དབང་པོ་གཟུགས་ཀྱི་སྐུར་མི་ལྟ།
en: Do not see the Lord of Jinas as a rūpakāya. {15}

source: །ཁྱོད་ལ་བསྒོ་ཞིང་ཁོང་དུ་ཆུད་པར་བྱ།
en: “I proclaim to you and make it known to you

source: །ཇི་ལྟར་མི་དག་མང་དུ་རྟོག་བྱེད་པ།
en: That to the extent that a person contemplates this, To that extent their mind will be fixed upon it,

source: །དེ་ལ་གནས་པའི་རྟོག་པ་དེ་དག་གིས།
en: Through that contemplation that dwells upon it. {16}

source: །དེ་བཞིན་དུ་ནི་དེ་ལ་སེམས་གཞོལ་འགྱུར།
en: “Those who remember in that way the appearance

source: །དེ་བཞིན་རྒྱལ་བ་ཡི་ནི་སྐུ་བྱད་དང་། །ཡེ་ཤེས་དཔག་ཏུ་མེད་པར་ཐུབ་དབང་དྲན།
en: And immeasurable wisdom of the Lord of Sages,

source: །རྟག་པར་རྗེས་སུ་དྲན་པ་བསྒོམ་བྱས་ན། །དེ་ལ་སེམས་གཞོལ་རབ་ཏུ་འབབ་པར་འགྱུར།
en: They will have their mind completely focused upon him Through constant meditation on that recollection. {17}

source: །དེ་ནི་འཆགས་འདུག་འགྲེང་ཞིང་གནས་པའི་ཚེ།
en: “When walking, sitting, or standing,

source: །སྐྱེས་བུ་དམ་པའི་ཡེ་ཤེས་རབ་ཏུ་འདོད།
en: They desire the wisdom of the best of beings,

source: །འཇིག་རྟེན་རྒྱལ་བ་བླ་མེད་བདག་འགྱུར་བར། །འདོད་པས་བྱང་ཆུབ་ཏུ་ཡང་སྨོན་ལམ་འདེབས།
en: And pray for enlightenment, wishing to become A jina who is unsurpassable in this world. {18}

source: །དེས་ནི་སངས་རྒྱས་ཤེས་ཤིང་སངས་རྒྱས་མཐོང་། །སངས་རྒྱས་ཆོས་ཉིད་ལ་ཡང་སོ་སོར་རྟོག །ཏིང་འཛིན་འདི་ལ་རབ་ཏུ་གནས་བྱས་ནས།
en: “They will know the buddhas and see the buddhas; They will realize the nature of the buddhas. Remaining in this samādhi,

source: །མཐུ་ཆེན་སངས་རྒྱས་ལ་ནི་ཕྱག་ཀྱང་འཚལ།
en: They will pay homage to the buddhas who have great might. {19}

source: །ལུས་དང་ངག་དང་ཡིད་རབ་དང་བ་ཡིས།
en: “With serene body, speech, and mind,

source: །རྟག་ཏུ་སངས་རྒྱས་དག་གི་བསྔགས་པ་བརྗོད།
en: They constantly recite praises to the buddhas.

source: །དེ་ལྟར་དེས་ནི་སེམས་ཀྱི་རྒྱུད་བསྒོམས་པས།
en: In that way, through the mind’s continuum of meditation,

source: །ཉིན་མཚན་དུ་ཡང་འཇིག་རྟེན་མགོན་པོ་མཐོང་། །ནམ་ཞིག་དེ་ནི་ན་ཞིང་མི་བདེ་ནས།
en: Day and night they see the Lord of the World. {20} “When the time comes that they are sick and unwell

source: །ཤི་ལ་ཐུག་པའི་སྡུག་བསྔལ་ཚོར་བྱུང་ན།
en: And experience the suffering of dying,

source: །སངས་རྒྱས་ལ་ནི་དྲན་པ་མི་ཉམས་ཏེ།
en: They will not lose their recollection of the Buddha,

source: །སྡུག་བསྔལ་ཚོར་བས་འཕྲོགས་པར་ཡོང་མི་འགྱུར།
en: And it will not be stolen away by the experience of suffering. {21}

source: །དེ་ལྟར་དེ་དག་ཡེ་ཤེས་རྣམ་བརྟགས་པས།
en: “Having analyzed with wisdom in that way,

source: །འོངས་དང་མ་འོངས་ཆོས་རྣམས་སྟོང་པར་ཤེས།
en: They know all present, past, and future phenomena to be empty.

source: །དེ་འདྲའི་ཆོས་ཀྱི་ཚུལ་ལ་དེ་གནས་པ།
en: They remain in that nature of phenomena

source: །སྤྱོད་པ་ཡོངས་སུ་སྤྱོད་པས་སེམས་མི་སྐྱོ།
en: And perform bodhisattva conduct without being disheartened. {22}

source: །དེ་ཕྱིར་ཕན་ཡོན་འདི་དག་ཐོས་ནས་ནི།
en: “Therefore, having heard these benefits,

source: །མཚུངས་མེད་བྱང་ཆུབ་ལ་ཡང་མོས་པ་སྐྱེད།
en: You should long for unequaled enlightenment.

source: །བདེ་གཤེགས་དམ་པ་མཐོང་བ་རྙེད་དཀའ་ཡིས།
en: It is difficult to see the sublime Sugata,

source: །ཕྱི་མའི་དུས་ན་འགྱོད་པ་སྐྱེས་ས་རེ།
en: So do not have cause for regret in the future. {23}

source: །ངས་ནི་རབ་ཏུ་བཟང་བའི་ཆོས་བཤད་ཀྱང་།
en: “I have taught this excellent Dharma

source: །ཁྱེད་ཀྱིས་ཐོས་ནས་ཡང་དག་མ་སྤྱད་ན།
en: But if you do not practice it well

source: །ནད་པ་སྨན་གྱི་རྒྱལ་བ་ཐོགས་པ་དག །བདག་གི་ནད་ནི་གསོ་བར་མི་ནུས་བཞིན།
en: You will be like a sick man holding a bag of medicine— That alone will not cure his illness. {24}

source: །དེ་ཕྱིར་མཁས་པ་ཤིན་ཏུ་རྟོགས་པ་དག །རྟག་ཏུ་ཏིང་འཛིན་འདི་ནི་འདོད་པ་ཡིས།
en: “Therefore, the wise and the realized Are always aspiring to this samādhi.

source: །ཚུལ་ཁྲིམས་ཐོས་པ་གཏོང་བ་བསྙེན་བྱས་ན།
en: And if they practice correct conduct, learning, and generosity

source: །ཏིང་འཛིན་འདི་ནི་རྙེད་པར་ཡོང་མི་དཀའ།
en: It will not be difficult for them to attain this samādhi.” {25}

source: །ཏིང་ངེ་འཛིན་གྱི་ལེའུ་སྟེ་བཞི་པའོ།། །།
en: Conclusion of the fourth chapter, “Samādhi.” Ghoṣadatta Chapter 5

source: དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ། གཞོན་ནུ་དེ་ལྟ་བས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཏིང་ངེ་འཛིན་འདི་འདོད་ཅིང་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་མགོ་དང་གོས་ལ་མེ་འབར་བ་ལྟ་བུའི་སེམས་ཀྱིས་ཕ་དང་མ་དང་བུ་དང་བུ་མོ་དང་ཉེ་དུ་དང་སྣག་གི་གཉེན་མཚམས་དང་གཉེན་དང་རྩ་ལག་དང་ཆུང་མ་ལ་སོགས་པ་མེ་བཞིན་དུ་སྤངས་ལ་རྒྱལ་སྲིད་ཀྱི་བདེ་བ་ཐམས་ཅད་མཆིལ་མའི་ཐལ་བ་བཞིན་དུ་བོར་ཏེ། དགོན་པ་ལ་མངོན་དུ་ཕྱོགས་ཤིང་ཁྱིམ་གྱི་གནས་ནས་མངོན་པར་འབྱུང་བར་བྱའོ།
en: Then the Bhagavān again addressed the youth Candraprabha, saying, “Therefore, young man, bodhisattva mahāsattvas who wish for this samādhi, and wish to attain quickly the highest, complete enlightenment of perfect buddhahood, should think that they are like someone whose hair and clothes are on fire, and they should cast off father, mother, son, daughter, family, kinsmen, relatives, kindred, wife, and so on, as if they were fire, throw away all the pleasures of a kingdom as if they were a lump of phlegm, turn toward solitude, and depart from home.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Why is that?

source: གཞོན་ནུ་དགོན་པ་ལ་མངོན་དུ་ཕྱོགས་ཤིང་ཁྱིམ་གྱི་གནས་ནས་མངོན་པར་འབྱུང་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱང་རྙེད་པར་དཀའ་བ་མ་ཡིན་ན་ཏིང་ངེ་འཛིན་འདི་ལྟ་ཅི་སྨོས་ཏེ།
en: Young man, attaining the highest, complete enlightenment of perfect buddhahood will not be difficult for a bodhisattva mahāsattva who turns toward solitude and departs from home, let alone one who has this samādhi.

source: གཞོན་ནུ་དེ་ལྟ་བས་ན་བུ་དང་མཛའ་བོ་དང་། ཉེ་དུ་དང་སྣག་གི་གཉེན་མཚམས་དང་གཉེན་དང་རྩ་ལག་དང་ཆུང་མ་ལ་སོགས་པ་མེ་བཞིན་དུ་སྤངས་ལ་རྒྱལ་སྲིད་ཀྱི་བདེ་བ་ཐམས་ཅད་མཆིལ་མའི་ཐལ་བ་བཞིན་དུ་བོར་ཏེ། དགོན་པ་ལ་མངོན་དུ་ཕྱོགས་ཤིང་། ཁྱིམ་གྱི་གནས་ནས་མངོན་པར་འབྱུང་བར་བྱའོ་ཞེས་གཞོན་ནུ་ཁྱོད་ཀྱིས་དེ་ལྟར་རྟག་ཏུ་བསླབ་པར་བྱའོ།
en: “Therefore, young man, you should always train in having this thought: ‘I shall cast off friends, children, family, kinsmen, relatives, kindred, wife, and so on, as if they were fire, throw away all the pleasures of a kingdom as if they were a lump of phlegm, turn toward solitude, and depart from home.’

source: །གཞོན་ནུ་དེ་ལྟ་བས་ན་རྣམ་གྲངས་འདིས་ཀྱང་ཁྱོད་ཀྱིས་འདི་ལྟར་རིག་པར་བྱ་སྟེ།
en: “Therefore, young man, you should understand this through the following teaching, too:

source: གཞོན་ནུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མེད་པ་བས་ཀྱང་ཆེས་གྲངས་མེད་པ། རྒྱ་ཆེ་བ། དཔག་ཏུ་མེད་པ། བསམ་གྱིས་མི་ཁྱབ་པ་གཞལ་དུ་མེད་པར་གྱུར་པ་དེའི་ཚེ་དེའི་དུས་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དབྱངས་བྱིན་ཞེས་བྱ་བ་རིག་པ་དང་ཞབས་སུ་ལྡན་པ།
en: “Young man, in the past, countless, vast, immeasurable, inconceivable, innumerable, asaṃkhyeya eons ago, at that time and in those days, there appeared in the world the Bhagavān, the tathāgata, the arhat, the perfectly enlightened Buddha Ghoṣadatta, who was perfect in wisdom and conduct, a sugata, a knower of the world, an unsurpassable guide who tamed beings, a teacher of devas and humans, a buddha, and a bhagavān.

source: བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །གཞོན་ནུ་དེའི་ཚེ་དེའི་དུས་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དབྱངས་བྱིན་དེའི་ཉན་ཐོས་འདུས་པ་དང་པོ་ནི་ཐམས་ཅད་ཀྱང་དགྲ་བཅོམ་པ་ཤ་སྟག་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་བྱུང་ངོ་།
en: “Young man, at that time and in those days, in the first assembly of the Bhagavān, the tathāgata, the arhat, the perfectly enlightened Buddha Ghoṣadatta’s śrāvakas, there were eight hundred million who were arhats.

source: །ཉན་ཐོས་འདུས་པ་གཉིས་པ་ནི་དགྲ་བཅོམ་པ་བྱེ་བ་ཕྲག་བདུན་ཅུ་བྱུང་ངོ་།
en: In the second assembly there were seven hundred million arhats.

source: །འདུས་པ་གསུམ་པ་ནི་དགྲ་བཅོམ་པ་བྱེ་བ་ཕྲག་དྲུག་ཅུ་བྱུང་ངོ་།
en: In the third assembly of śrāvakas there were six hundred million arhats.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ཡང་དཔག་ཏུ་མེད་པ་དག་བྱུང་ངོ་།
en: There were also countless bodhisattva mahāsattvas who possessed the Dharma.

source: །གཞོན་ནུ་དེའི་ཚེ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དབྱངས་བྱིན་དེའི་ཚེའི་ཚད་ནི་ལོ་བཞི་ཁྲིར་གྱུར་ཏོ།
en: “Young man, at that time and in those days, during the time of the Bhagavān, the tathāgata, the arhat, the perfectly enlightened Buddha Ghoṣadatta, the lifespan was forty thousand years.

source: །འཛམ་བུའི་གླིང་འདི་ཡང་འབྱོར་པ་རྒྱས་པ་བདེ་བ། ལོ་ལེགས་པ། ཉམས་དགའ་བ། སྐྱེ་བོ་དང་མི་མང་པོས་གང་བར་གྱུར་ཏོ།
en: This Jambudvīpa continent had wealth, increase, happiness, excellent harvests, joy, and was filled with a great multitude of human beings.

source: །འཛམ་བུའི་གླིང་འདི་ན་རྒྱལ་པོ་སྟོབས་བརྟན་དང་། སྟོབས་ཆེན་ཞེས་བྱ་བ་གཉིས་ཡོད་དེ།
en: “In this Jambudvīpa there were two kings named Dṛḍhabala and Mahābala.

source: དེ་ལ་གཅིག་ནི་འཛམ་བུའི་གླིང་འབྱོར་པ། རྒྱས་པ་བདེ་བ་ལོ་ལེགས་པ། ཉམས་དགའ་བ། སྐྱེ་བོ་དང་མི་མང་པོས་གང་བའི་ཕྱེད་ལ་དབང་ངོ་།
en: One ruled the half of Jambudvīpa that had wealth, increase, happiness, excellent harvests, joy, and was filled with a great multitude of human beings.

source: །ཅིག་ཤོས་ཀྱང་དེའི་ཕྱེད་ལ་དབང་ངོ་།
en: The other ruled the other half.

source: །གཞོན་ནུ་དེའི་ཚེ་དེའི་དུས་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དབྱངས་བྱིན་དེ་རྒྱལ་པོ་སྟོབས་ཆེན་གྱི་རྣམ་པར་རྒྱལ་བའི་སར་བྱུང་སྟེ།
en: “Young man, at that time, the Bhagavān, the tathāgata, the arhat, the perfectly enlightened Buddha Ghoṣadatta appeared in the kingdom of King Mahābala.

source: གཞོན་ནུ་དེ་ལྟར་རྒྱལ་པོ་སྟོབས་ཆེན་གྱིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དབྱངས་བྱིན་དེ་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་དང་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པ་ལ་ན་བཟའ་དང་བསོད་སྙོམས་དང་། སྙུན་གསོས་ཀྱི་སྨན་དང་ཡོ་བྱད་བརྟགས་པ་ཀུན་དུ་སྤྱད་པར་རུང་བ། ཁ་ན་མ་ཐོ་བ་མེད་པ་ལ་ལོ་བརྒྱ་སྟོང་ཚང་བར་སྤྱན་དྲངས་སོ།
en: “Young man, for a hundred thousand years King Mahābala provided the Bhagavān, the tathāgata, the arhat, the perfectly enlightened Buddha Ghoṣadatta, the saṅgha of bodhisattvas, and the saṅgha of bhikṣus with faultless, proper clothing, alms, medicine if they were ill, and monastic utensils for their use.

source: །གཞོན་ནུ་དེའི་ཚེ་དེའི་དུས་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དབྱངས་བྱིན་དེ་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་དང་བཅས་པ་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་རྙེད་པ་དང་བཀུར་སྟི་དང་གྲགས་པ་ཆེ་བར་གྱུར་ཏོ།
en: “Young man, at that time, the Bhagavān, the tathāgata, the arhat, the perfectly enlightened Buddha Ghoṣadatta, the saṅgha of bodhisattvas, and the saṅgha of bhikṣus received greatly renowned gifts and honors.

source: །བྲམ་ཟེ་དང་ཁྱིམ་བདག་དད་པ་དག་གིས་ཀྱང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དབྱངས་བྱིན་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་དང་བཅས། ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་ལ་རྙེད་པ་དང་བཀུར་སྟི་ཆེར་བྱས་སོ།
en: “Brahmins and householders who had faith also bestowed great gifts and honors on the Bhagavān, the tathāgata, the arhat, the perfectly enlightened Buddha Ghoṣadatta, the saṅgha of bodhisattvas, and the saṅgha of bhikṣus.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དབྱངས་བྱིན་ལ་བྲམ་ཟེ་དང་ཁྱིམ་བདག་དེ་དག་གིས་ཀྱང་འདི་ལྟ་སྟེ། རྒྱལ་པོ་སྟོབས་ཆེན་གྱི་རྗེས་སུ་སློབ་ཅིང་འཇིག་རྟེན་གྱི་ཟང་ཟིང་གི་མཆོད་པས་རྙེད་པ་དང་བཀུར་སྟི་བྱ་བའི་ཕྱིར་བརྩོན་པར་གྱུར་ཏོ།
en: “Those brahmins and householders did this by following the example of King Mahābala, dedicating themselves to bestowing great gifts and honors by making offerings of worldly material goods to the Bhagavān, the tathāgata, the arhat, the perfectly enlightened Buddha Ghoṣadatta, the saṅgha of bodhisattvas, and the saṅgha of bhikṣus.

source: །གཞོན་ནུ་དེ་ལྟ་བས་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དབྱངས་བྱིན་འདི་སྙམ་དུ་གྱུར་ཏེ།
en: “Young man, the Bhagavān, the tathāgata, the arhat, the perfectly enlightened Buddha Ghoṣadatta thought, ‘Alas!

source: ཀྱེ་མའོ་སེམས་ཅན་འདི་དག་ནི་ཚུལ་ཁྲིམས་དང་གསོ་སྦྱོང་ཡང་དག་པར་བླང་བ་དང་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དྲུང་དུ་ཉེ་བར་འགྲོ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ལ་བསྙེན་བཀུར་བྱ་བ་དང་། ཚངས་པར་སྤྱོད་པ་ལ་གནས་པ་དང་རབ་ཏུ་བྱུང་ཞིང་བསྙེན་པར་རྫོགས་པ་དགེ་སློང་གི་དངོས་པོར་འགྱུར་བ་ལས་ཡོངས་སུ་ཉམས་པར་འགྱུར་ཏེ།
en: These beings who have adopted correct conduct and the poṣadha vows have come before the Tathāgata, have honored the Tathāgata, practice celibacy, have entered the homeless life, and have become fully ordained bhikṣus—they will go into decline.

source: སེམས་ཅན་འདི་དག་ནི་དེའི་འོག་ཏུ་བདེ་བ་ལ་ལྷུར་བྱེད་པར་འགྱུར་རོ།
en: They are concerned about the happiness of their future lives.

source: དེ་ནི་འདི་ལྟར་དེའི་འོག་ཏུ་བདེ་བ་ནི་འདི་ལྟ་སྟེ། འཇིག་རྟེན་གྱི་ཟང་ཟིང་གི་མཆོད་པ་ནི་འདི་ཡིན་ཏེ། སེམས་ཅན་འདི་དག་ནི་འདི་ལྟ་སྟེ།
en: It is because in their future lives their happiness will be from these offerings of worldly material things.

source: མཐོ་རིས་ཀྱི་འཇིག་རྟེན་ལ་དམིགས་ཤིང་ཚེ་འདི་ལྷུར་བྱེད་པ།
en: The realms of the higher existences are the goal of these beings. They are concerned with this life.

source: ཚེ་ཕྱི་མ་ལྷུར་མི་བྱེད་པ་སྟེ།
en: They are concerned with their next life.

source: དགེ་བའི་རྩ་བ་ཤིན་ཏུ་མཐར་གཏུགས་པའི་ཕྱིར་ནི་མ་ཡིན་ནོ།
en: They do not accumulate roots of merit for the final ultimate goal.’

source: །གཞོན་ནུ་དེ་ལ་དགེ་བའི་རྩ་བ་ཤིན་ཏུ་མཐར་གཏུགས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “Young man, what are the roots of merit for the ultimate goal?

source: ཤིན་ཏུ་རྣམ་པར་དག་པ་དང་ཚངས་པར་སྤྱོད་པ་ལ་ཤིན་ཏུ་གནས་པ་དང་ཤིན་ཏུ་མཐར་ཕྱིན་པ་དང་ཤིན་ཏུ་མཐར་གཏུགས་པའོ།
en: They are pure conduct and celibacy going toward the ultimate goal and reaching the ultimate goal.

source: །ངས་སེམས་ཅན་དེ་དག་ལ་ཅི་ནས་ཀྱང་བླ་ན་མེད་པའི་ཆོས་ཀྱི་མཆོད་པ་དང་ཆོས་ཀྱི་ནན་ཏན་གྱིས་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པར་འགྱུར་བ་དེ་ལྟ་དེ་ལྟར་ཆོས་བཤད་པར་བྱའོ་སྙམ་མོ།
en: “Bhagavān Ghoṣadatta thought, ‘I must teach those beings the Dharma so that they will make the unsurpassable offering of the Dharma and the practice of the Dharma as their offering to the Tathāgata.’

source: །གཞོན་ནུ་དེ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དབྱངས་བྱིན་གྱིས་དེའི་ཚེ་རྒྱལ་པོ་སྟོབས་ཆེན་དང་བྲམ་ཟེ་དང་ཁྱིམ་བདག་དེ་དག་སྐྱོ་བར་བྱ་བར་དགོངས་པས་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ།
en: “Then, young man, at that time the Bhagavān, the tathāgata, the arhat, the perfectly enlightened Buddha Ghoṣadatta, with the intention of creating revulsion toward saṃsāra, recited these verses to King Mahābala, the brahmins, and the laypeople:

source: །སྦྱིན་པ་རབ་བྱིན་གཅིག་ལ་གཅིག་བསྟེན་པ།
en: “ ‘The service of someone making a gift to another

source: །དེ་དག་ཕན་ཚུན་རི་མོར་བྱེད་མི་འགྱུར།
en: Is not a cause for holding each other in high esteem.

source: །མཁས་པ་བག་ཆགས་རབ་ཏུ་སྤངས་པ་ཡི།
en: The wise ones who are free of negative propensities,

source: །སངས་རྒྱས་དག་གིས་བསྟེན་པ་དེ་མི་བསྔགས།
en: The buddhas, they do not praise that service. {1}

source: །གང་དག་སྲོགས་ཆགས་ཕན་ཕྱིར་ཆོས་སྟོན་པ། །དེ་འདྲའི་མི་དེས་ཤིན་ཏུ་བསྟེན་པ་ཡིན།
en: “ ‘Those who teach the Dharma for the benefit of beings, They are those who accomplish great service.

source: །དེ་དག་གཅིག་ལ་གཅིག་ཀྱང་མི་ཕྱེད་མཛའ།
en: Then there will form an unbreakable bond of friendship,

source: །བྱེ་བ་སྙེད་ཀྱི་བདུད་ཀྱིས་དབྱེ་མི་ནུས།
en: Which not even ten million māras will be able to break. {2}

source: །འཇིག་རྟེན་ཟང་ཟིང་དག་གིས་སྟེན་པའི་མི།
en: “ ‘The service of those who keep to worldly material things

source: །དེ་དག་ཚེ་འདིའི་དོན་དུ་ཀུན་འགྱུར་གྱི།
en: Will all be for the benefit of the present life.

source: །ཟང་ཟིང་མེད་པའི་ཆོས་ལ་བསྟེན་པ་ནི།
en: The immaterial service of the Dharma

source: །མི་དག་གི་ཡང་རབ་ཏུ་དོན་ཆེར་འགྱུར།
en: Leads to the greatest benefit for humans. {3}

source: །ཟང་ཟིང་མེད་པའི་སེམས་ནི་ཉེར་བཞག་སྟེ།
en: “ ‘Those who have a nonmaterialistic motivation

source: །ཟང་ཟིང་མེད་པའི་ཆོས་རྣམས་རབ་བཤད་ལ།
en: And teach the nonmaterial Dharma,

source: །གང་དག་ཟང་ཟིང་མེད་པའི་དགའ་ལྡན་པ།
en: Those individuals who gain nonmaterial joy,

source: །དེ་འདྲ་དེ་དག་མྱུར་དུ་སངས་རྒྱས་འགྱུར།
en: They will quickly attain buddhahood. {4}

source: །འདོད་པ་དག་ལ་རབ་ཏུ་སྟེན་བྱེད་ཅིང་།
en: “ ‘Those who are addicted to their desires,

source: །བུ་དང་ཆུང་མ་ལ་ཡང་སྲིད་བསྐྱེད་ནས།
en: Who crave for children and wives,

source: །ཁྱིམ་གནས་སྨད་པ་ཉིད་ལ་སྟེན་བྱེད་ན།
en: Who are addicted to their revolting homes,

source: །བླ་མེད་བྱང་ཆུབ་མཆོག་དེས་ཡོང་མི་འཐོབ།
en: Will not attain unsurpassable, highest enlightenment. {5} “ ‘Supreme enlightenment will not be difficult to attain

source: །སུ་དག་མེ་མུར་བཞིན་དུ་འདོད་སྤོང་ཞིང་།
en: For those who avoid desire as if it were a pit of fire,

source: །བུ་དང་ཆུང་མ་ལ་ཡང་སྲིད་སྤངས་ནས། །སྐྲག་ཅིང་དངངས་པས་ཁྱིམ་ནས་མངོན་བྱུང་བ།
en: Who abandon craving for children and wives, And, frightened and terrified, leave their homes. {6} “ ‘There have been no buddhas in the past, Nor will there be any in the future or now in the present,

source: །དེ་དག་བྱང་ཆུབ་མཆོག་འདི་རྙེད་མི་དཀའ། །གང་དག་ཁྱིམ་གྱི་དབུས་ན་འདུག་བཞིན་དུ། །བྱང་ཆུབ་དམ་པ་མཆོག་འདི་ཐོབ་པ་ནི། །དེ་འདྲའི་སངས་རྒྱས་གང་ཡང་སྔོན་མ་བྱུང་། །མ་བྱོན་པ་དང་ད་ལྟར་བཞུགས་པའང་མེད།
en: Who attain the highest, most supreme enlightenment While living inside their homes. {7}

source: །རྒྱལ་སྲིད་མཆིལ་མ་བཞིན་དུ་རབ་སྤངས་ལ།
en: “ ‘Casting away a kingdom like a lump of phlegm,

source: །དབེན་པ་འདོད་པས་དགོན་པར་གནས་པར་གྱིས།
en: Longing for solitude and living in the forests,

source: །ཉོན་མོངས་རབ་སྤངས་བདུད་ཀྱང་རྣམ་བཅོམ་ན།
en: Eliminating the kleśas and defeating the māras,

source: །བྱང་ཆུབ་རྡུལ་མེད་འདུས་མ་བྱས་པ་རྟོགས། །སངས་རྒྱས་དཔའ་བོ་གང་གཱའི་བྱེ་མ་སྙེད། །བསྐལ་པ་བྱེ་མང་རིམ་གྲོ་སུས་བྱས་པས།
en: They will realize stainless, noncomposite enlightenment. {8}

source: །གང་ཞིག་ཡོངས་སུ་སྐྱོ་བའི་ཡིད་ཀྱིས་ནི། །ཁྱིམ་ནས་མངོན་པར་བྱུང་ན་འདི་མཆོག་འགྱུར།
en: “ ‘People who, with a disenchanted mind, Leave their homes, they are superior To those who serve, for many millions of eons, Heroic buddhas as numerous as the Ganges sands. {9}

source: །ཇི་ལྟར་རབ་ཏུ་བྱུང་ནས་ཆོས་སྤྱོད་པ།
en: “ ‘People who leave their homes and practice the Dharma, Without serving the supreme humans, the jinas,

source: །དེ་ལྟར་ཟས་དང་སྐོམ་དང་ཆོས་གོས་དང་། །མེ་ཏོག་དང་ནི་སྤོས་དང་བྱུག་པ་ཡིས། །མི་མཆོག་རྒྱལ་བ་རིམ་གྲོ་བྱས་མ་ཡིན།
en: With food, drink, and Dharma robes, With flowers, incense, and ointments— {10}

source: །སུ་དག་བྱང་ཆུབ་ཏུ་ཡང་འདོད་མོས་ཤིང་།
en: “ ‘Those who, longing for enlightenment,

source: །སེམས་ཅན་དོན་ཕྱིར་འདུས་བྱས་ཡོངས་སྐྱོ་ནས།
en: Disillusioned with the composite, and for the benefit of beings,

source: །དགོན་པར་བལྟས་ཏེ་གོམ་པ་བདུན་བོར་ན།
en: Take seven steps in the direction of the forests—

source: །དེ་བས་བསོད་ནམས་འདི་ནི་ཁྱད་པར་འཕགས།
en: They will have the superior merit.’ {11}

source: །དེ་ནས་གཞོན་ནུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དབྱངས་བྱིན་གྱིས་ཁྱིམ་ནས་མངོན་པར་འབྱུང་བ་དང་ལྡན་པའི་གཏམ་བརྗོད་པ་དེ་ལྟ་བུ་རྒྱལ་པོ་སྟོབས་ཆེན་གྱིས་ཐོས་སོ།
en: “Young man, King Mahābala heard what the Bhagavān, the tathāgata, the arhat, the perfectly enlightened Buddha Ghoṣadatta said about leaving one’s home.

source: །ཐོས་ནས་ཀྱང་ཇི་ལྟར་བདག་གིས་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་པའི་དོན་ཤེས་པ་ལྟར་ན་བཅོམ་ལྡན་འདས་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བསྔགས་པ་མི་བརྗོད་ཀྱི་བཅོམ་ལྡན་འདས་ནི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཤིན་ཏུ་མཐར་གཏུགས་པའི་བསྔགས་པ་བརྗོད་དེ། བཅོམ་ལྡན་འདས་ཀྱིས་ཤིན་ཏུ་རྣམ་པར་དག་པ་དང་ཚངས་པར་སྤྱོད་པ་ལ་ཤིན་ཏུ་གནས་པ་དང་ཤིན་ཏུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་བསྔགས་སོ་ཞེས་བསམས་ནས་དེ་འདི་སྙམ་དུ་ཁྱིམ་ན་གནས་པས་བླ་ན་མེད་པའི་ཆོས་ཀྱི་ནན་ཏན་སྒྲུབ་པའམ། དོན་རྗེས་སུ་ཐོབ་པར་འགྱུར་བ་འདི་ནི་སླ་བ་མ་ཡིན་ཏེ།
en: Having heard this, he thought, ‘I have understood the Bhagavān’s teaching to mean that he does not praise the perfection of generosity, but gives the highest, ultimate praise to the perfection of conduct. The Bhagavān has praised perfect purity, perfect celibacy, and perfect nirvāṇa.’ “He thought, ‘It is not easy to practice the unsurpassable Dharma and attain its goal while living in a home.

source: བླ་ན་མེད་པའི་ཆོས་ཀྱི་ནན་ཏན་ལས་བདག་ཡོངས་སུ་ཉམས་པར་འགྱུར་གྱིས།
en: I would decline in my practice of the unsurpassable Dharma.

source: བདག་ནི་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ཏེ་གོས་ངུར་སྨྲིག་བགོས་ནས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་འབྱུང་ངོ་སྙམ་མོ།
en: I shall cut off my hair and beard, wear the orange robes, and leave home for homelessness.’

source: །གཞོན་ནུ་དེ་ནས་རྒྱལ་པོ་སྟོབས་ཆེན་བྲམ་ཟེ་དང་ཁྱིམ་བདག་བརྒྱད་ཁྲིས་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ། དེ་དག་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དབྱངས་བྱིན་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: “Then, young man, King Mahābala, accompanied by eighty thousand brahmins and laypeople, came before the Bhagavān, the tathāgata, the arhat, the perfectly enlightened Buddha Ghoṣadatta, bowed down to his feet, circumambulated the Bhagavān three times, and sat to one side.

source: །དེ་ནས་གཞོན་ནུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེས་རྒྱལ་པོ་སྟོབས་ཆེན་གྱི་ལྷག་པའི་བསམ་པ་མཁྱེན་ནས་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་རྣམ་པར་སྤྲོས་པའི་ཏིང་ངེ་འཛིན་འདི་བཤད་དོ།
en: “Young man, the Bhagavān, the tathāgata, the arhat, the perfectly enlightened Buddha, knowing the higher motivation of King Mahābala, taught this samādhi, the revealed equality of the nature of all phenomena.

source: །དེ་ནས་གཞོན་ནུ་རྒྱལ་པོ་སྟོབས་ཆེན་ཏིང་ངེ་འཛིན་འདི་ཐོས་ནས་དགའ་བ་དང་མགུ་བ་དང་རངས་པ་དང་རབ་ཏུ་མོས་པ་དང་ཡིད་བདེ་བ་སྐྱེས་ནས་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ཏེ་གོས་ངུར་སྨྲིག་བགོས་ནས་ཡང་དག་པར་དད་པས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་བར་གྱུར་ཏོ།
en: “Young man, on hearing this, King Mahābala was pleased, delighted, joyful, inspired, and happy. He shaved off his hair and beard, put on the orange robes, and with faith left home for homelessness.

source: །དེ་དེ་ལྟར་རབ་ཏུ་བྱུང་ནས་ཏིང་ངེ་འཛིན་འདི་བཟུང་སྟེ་བཟུང་ཞིང་ཀུན་ཆུབ་པར་བྱས།
en: Having entered homelessness he learned this samādhi, and having learned it he understood it.

source: བཅངས་ཤིང་བཀླགས་ནས་བསྒོམ་པའི་རྣལ་འབྱོར་ལ་རྗེས་སུ་བརྩོན་པར་གནས་པར་གྱུར་ཏོ།
en: He dedicated himself to the practice of keeping it, reading it, and meditating on it.

source: །དེ་དགེ་བའི་རྩ་བ་དེ་ཉིད་ཀྱིས་བསྐལ་པ་བྱེ་བ་ཕྲག་བཅུའི་བར་དུ་ནམ་ཡང་ངན་འགྲོ་ལོག་པར་ལྟུང་བར་མ་སོང་སྟེ།
en: Through that root of merit, he did not fall into the lower existences for a hundred million eons.

source: སངས་རྒྱས་བྱེ་བ་ཕྲག་ཉི་ཤུ་ལ་བསྙེན་བཀུར་བྱས་ཤིང་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ལས་ཀྱང་ཏིང་ངེ་འཛིན་འདི་ཐོས་སོ། །སངས་རྒྱས་དེ་དག་ལས་ཐོས་ནས་དེས་བཟུང་སྟེ།
en: He served two hundred million buddhas and heard this samādhi from all those tathāgatas. He learned this samādhi, and having learned it he understood it.

source: ཀུན་ཆུབ་པར་བྱས། བཅངས་ཤིང་བཀླགས་ནས་བསྒོམ་པའི་རྣལ་འབྱོར་ལ་རྗེས་སུ་བརྩོན་པར་གནས་སོ།
en: He dedicated himself to the practice of keeping it, reading it, and meditating on it.
